In [2]:
import pyodbc
conn = pyodbc.connect('Driver={SQL Server};'
                      'Server=LAPTOP-S1V0PRKL;'
                      'Database=PythonTest;'
                      'Trusted_Connection=yes;')
 
cursor1 = conn.cursor()

In [3]:
account_list = (286,148,203)
address_list = ('100 Tryon Rd APT 1', '101 Tryon Rd APT 5', '102 Tryon Rd APT 1')
sql_command = """SELECT * FROM  [TEST1].[order_table]
                 WHERE account_id in (%s)
                 and address in (%s)
              """%(','.join('?' * len(account_list)), ','.join('?' * len(address_list)))

print(sql_command)
cursor1.execute(sql_command,account_list + address_list)

for row in cursor1:
    print(row)

SELECT * FROM  [TEST1].[order_table]
                 WHERE account_id in (?,?,?)
                 and address in (?,?,?)

(286, '100 Tryon Rd APT 1', 2017, 4, Decimal('287.88'), Decimal('4.99'))
(148, '101 Tryon Rd APT 5', 2018, 8, Decimal('75.78'), Decimal('6.99'))
(203, '102 Tryon Rd APT 1', 2018, 10, Decimal('216.56'), Decimal('7.99'))

In [4]:
address_list = ('100 Tryon Rd', '101 Tryon Rd', '102 Tryon Rd')
sql_command = """SELECT * FROM  [TEST1].[order_table]
                 WHERE account_id in (%s)
                 and address in (%s)
              """%(','.join('?' * len(account_list)), ','.join('?' * len(address_list)))


cursor1.execute(sql_command,account_list + address_list)
for row in cursor1:
    print(row)

In [25]:
address_list = ('%100 Tryon Rd%', '%101 Tryon Rd%', '%102 Tryon Rd%')

sql_command = """SELECT * FROM  [TEST1].[order_table]
                 WHERE account_id in (%s)
                 and (address like '%s'
                      or address like '%s'
                      or address like '%s')
"""%(','.join('?' * len(account_list)),address_list[0],address_list[1],address_list[2] )

print (sql_command)

SELECT * FROM  [TEST1].[order_table]
                 WHERE account_id in (?,?,?)
                 and (address like '%100 Tryon Rd%'
                      or address like '%101 Tryon Rd%'
                      or address like '%102 Tryon Rd%')

In [5]:
address_list = ['100 Tryon Rd', '101 Tryon Rd', '102 Tryon Rd']

In [6]:
   
str_add = [""" t.[address] like '%""" + every_add + """%'"""for every_add in address_list]

print (str_add)

str_add = ' or '.join(str_add)

print(str_add)

str_list =[str_add]

print(str_list)
str_list1 = [str_add,]
print(str_list)

[" t.[address] like '%100 Tryon Rd%'", " t.[address] like '%101 Tryon Rd%'", " t.[address] like '%102 Tryon Rd%'"]
 t.[address] like '%100 Tryon Rd%' or  t.[address] like '%101 Tryon Rd%' or  t.[address] like '%102 Tryon Rd%'
[" t.[address] like '%100 Tryon Rd%' or  t.[address] like '%101 Tryon Rd%' or  t.[address] like '%102 Tryon Rd%'"]
[" t.[address] like '%100 Tryon Rd%' or  t.[address] like '%101 Tryon Rd%' or  t.[address] like '%102 Tryon Rd%'"]

In [30]:
sql_command = """SELECT * FROM  [TEST1].[order_table] t
                 WHERE account_id in (%s)
                 and (%s)
"""%(','.join('?' * len(account_list)), str_list[0] )

print(sql_command)

SELECT * FROM  [TEST1].[order_table] t
                 WHERE account_id in (?,?,?)
                 and ( t.[address] like '%100 Tryon Rd%' or  t.[address] like '%101 Tryon Rd%' or  t.[address] like '%102 Tryon Rd%')

In [31]:
sql_command = """SELECT * FROM  [TEST1].[order_table] t
                 WHERE account_id in (%s)
                 and (%s)
"""%(','.join('?' * len(account_list)), str_add )

print(sql_command)

SELECT * FROM  [TEST1].[order_table] t
                 WHERE account_id in (?,?,?)
                 and ( t.[address] like '%100 Tryon Rd%' or  t.[address] like '%101 Tryon Rd%' or  t.[address] like '%102 Tryon Rd%')

STOP. 
EMPHASIZE.
REVIEW. 1. three double quote
        2. parameters use ?,?,? in the command 
           and provide value in execute as ???
           
        4. pieces sql command use %s in the string
           and substitue that %s with ???
           
        5. for unkown number of parameters, use %s in the string
           and substitue that %s with ???
           
           
           
test.

In [16]:
account_list = (286,148,203)

sql_command = """SELECT * FROM  [TEST1].[order_table]
                 WHERE account_id in (?,?,?)
                 and order_year in (?)
              """

cursor1.execute(sql_command,account_list + 2018)

TypeError: can only concatenate tuple (not "int") to tuple

In [15]:
account_list = (286,148,203)

sql_command = """SELECT * FROM  [TEST1].[order_table]
                 WHERE account_id in (?,?,?)
                 and order_year in (?)
              """

cursor1.execute(sql_command,account_list + (2018))

In [14]:
account_list = [286,148,203]

sql_command = """SELECT * FROM  [TEST1].[order_table]
                 WHERE account_id in (?,?,?)
                 and order_year in (?)
              """

cursor1.execute(sql_command,account_list + [2018])

In [18]:
account_list = {286,148,203}

sql_command = """SELECT * FROM  [TEST1].[order_table]
                 WHERE account_id in (?,?,?)
                 and order_year in (?)
              """

cursor1.execute(sql_command,account_list + {2018})

TypeError: unsupported operand type(s) for +: 'set' and 'set'

In [16]:
account_list = [286,148,203]
Year = 2018
account_string = [ str(every_acct) for every_acct in account_list]


str_acc = ' , '.join(account_string)

print(str_acc)

sql_command = """SELECT * FROM  [TEST1].[order_table]
                 WHERE account_id in (%s)
                 and order_year in (%s)
              """%(str_acc, str(Year))

print(sql_command)

286 , 148 , 203
SELECT * FROM  [TEST1].[order_table]
                 WHERE account_id in (286 , 148 , 203)
                 and order_year in (2018)

In [17]:
address_list = ('100 Tryon Rd APT 1', '101 Tryon Rd APT 5', '102 Tryon Rd APT 1')
str1= ','.join(address_list)


sql_command = """SELECT * FROM  [TEST1].[order_table]
                 WHERE address in (%s)
              """%(str1)

print(sql_command)

SELECT * FROM  [TEST1].[order_table]
                 WHERE address in (100 Tryon Rd APT 1,101 Tryon Rd APT 5,102 Tryon Rd APT 1)

In [20]:
address_list1 = ('100 Tryon Rd APT 1', '101 Tryon Rd APT 5', '102 Tryon Rd APT 1')
address_list2 = ("""'"""+every_address+"""'""" for every_address in address_list1)
str2= ','.join(address_list2)

sql_command = """SELECT * FROM  [TEST1].[order_table]
                 WHERE address in (%s)
              """%(str2)

print(sql_command)

SELECT * FROM  [TEST1].[order_table]
                 WHERE address in ('100 Tryon Rd APT 1','101 Tryon Rd APT 5','102 Tryon Rd APT 1')